In [ ]:
install.packages("RSQLite", version = "2.3.7")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
install.packages(c("dplyr", "glue"), version = "1.1.3") #dplyr version 1.1.3

Installing packages into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
library(tidyverse)
library(RSQLite)
library(glue)

In [ ]:
con <- dbConnect(SQLite(), "restaurant.db")

In [ ]:
dbListTables(con)

[1] "menu"  "staff"

In [ ]:
dbWriteTable(con, "staff",
            data.frame(staff_id = 1:3,
                        staff_name = c("Prae","David","T")))

In [ ]:
dbGetQuery(con, "select staff_name from staff")

  staff_name
1 Prae
2 David
3 T

In [ ]:
dbWriteTable(con,"menu",
                data.frame(menu_id = 1:5,
                menu_name = c("tomyam", "padthai", "noodle", "fried rice", "kaprao"),
                menu_price = c(100, 50, 60, 70, 65)))

In [ ]:
dbGetQuery(con, "select * from menu")

  menu_id menu_name  menu_price
1 1       tomyam     100
2 2       padthai     50
3 3       noodle      60
4 4       fried rice  70
5 5       kaprao      65

In [ ]:
dbWriteTable(con, "orders",
                data.frame(order_id = 1:10,
                order_date = c("2022-01-01", "2022-01-01",
                "2022-01-01", "2022-01-01", "2022-01-01",
                "2022-01-01", "2022-01-02", "2022-01-02",
                "2022-01-02", "2022-01-02"),
                staff_id = c(1, 2, 1, 5, 3, 4, 3, 1, 5, 2),
                menu_id = c(1, 2, 1, 5, 3, 4, 3, 1, 5, 2)))

In [ ]:
dbGetQuery(con, "select * from orders")

   order_id order_date staff_id menu_id
1   1       2022-01-01 1        1
2   2       2022-01-01 2        2
3   3       2022-01-01 1        1
4   4       2022-01-01 5        5
5   5       2022-01-01 3        3
6   6       2022-01-01 4        4
7   7       2022-01-02 3        3
8   8       2022-01-02 1        1
9   9       2022-01-02 5        5
10 10       2022-01-02 2        2

In [ ]:
dbGetQuery(con, "select staff_id, menu_id
                from orders
                where order_date = '2022-01-01'")

  staff_id menu_id
1 1        1
2 2        2
3 1        1
4 5        5
5 3        3
6 4        4